tap "afutured/openai-translator"
tap "akeru-inc/tap"
tap "anomalyco/tap"
tap "antoniorodr/cronboard"
tap "antoniorodr/memo"
tap "bigwig-club/brew"
tap "browsh-org/browsh"
tap "caarlos0/tap"
tap "daipeihust/tap"
tap "dnote/dnote"
tap "dzfrias/formulae"
tap "emilevr/space"
tap "eugene-babichenko/fixit"
tap "federico-terzi/espanso"
tap "filebrowser/tap"
tap "freed-wu/undollar", "https://github.com/Freed-Wu/undollar"
tap "gromgit/fuse"
tap "happyrip/happy-tap"
tap "jesseduffield/lazygit"
tap "jez/formulae"
tap "joshmedeski/sesh"
tap "kde-mac/kde", "https://invent.kde.org/packaging/homebrew-kde.git"
tap "keith/formulae"
tap "koekeishiya/formulae"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "libsql/sqld"
tap "lihaoyun6/tap"
tap "mach-kernel/pkgs"
tap "marcus/tap"
tap "mistertea/et"
tap "morantron/tmux-fingers"
tap "null-dev/firefox-profile-switcher"
tap "oven-sh/bun"
tap "steipete/tap"
tap "supabase/tap"
tap "textualize/homebrew"
tap "ttaatoo/microterm"
tap "tursodatabase/tap"
tap "yakitrak/yakitrak"
tap "zegervdv/zathura"
tap "zurawiki/brews"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# X.509 and CMS library
brew "libksba"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# General-purpose data compression with high compression ratio
brew "xz"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Email client that runs in your terminal
brew "aerc"
# Simple, modern, secure file encryption
brew "age"
# Asciicast to GIF converter
brew "agg"
# All-in-one AI-Powered CLI Chat & Copilot
brew "aichat"
# Fast and opinionated formatter for R code
brew "air"
# Library for manipulating PNG images
brew "libpng"
# Color management engine supporting ICC profiles
brew "little-cms2"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# C library implementing the SSH2 protocol
brew "libssh2"
# Download with resuming and segmented downloading
brew "aria2"
# GNU compiler collection
brew "gcc"
# High performance message passing library
brew "open-mpi"
# Spell checker with better logic than ispell
brew "aspell"
# Code searching, linting, rewriting
brew "ast-grep"
# Source code beautifier for C, C++, C#, and Java
brew "astyle"
# Message bus system, providing inter-application communication
brew "dbus"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Arbitrary precision numeric processing language
brew "bc"
# Tools for BCF/VCF files and variant calling from samtools
brew "bcftools"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Python code formatter
brew "black"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Fancy interface to the Python interpreter
brew "bpython"
# Outputs current CPU temperature for OSX
brew "osx-cpu-temp"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# Interpreter for the brainfuck language
brew "brainfuck"
# Install RubyGems as Homebrew formulae
brew "brew-gem"
# New way to see and navigate directory trees
brew "broot"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Burrow-Wheeler Aligner for pairwise alignment of DNA
brew "bwa"
# Software library to render fonts
brew "freetype"
# Vector graphics library with cross-device output support
brew "cairo"
# Helper program to build and install c-like libraries
brew "cargo-c"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Library for parsing ini files
brew "iniparser"
# Cross-platform library for audio I/O
brew "portaudio"
# Console-based Audio Visualizer for ALSA
brew "cava"
# Sexy ANSI fonts for the console
brew "cfonts"
# YAML Parser
brew "libyaml"
# Library and CLI tool to analyse CloudFormation templates for security issues
brew "cfripper"
# Ultralightweight JSON parser in ANSI C
brew "cjson"
# Cut, copy, and paste anything, anywhere, all from the terminal
brew "clipboard"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Unit testing framework for C
brew "cmocka"
# High performance code minimap generator
brew "code-minimap"
# Access VS Code through the browser
brew "code-server"
# Interactive terminal based UI application for tracking cryptocurrencies
brew "cointop"
# Tool for changing code across many languages
brew "comby"
# Utility that creates projects from templates
brew "cookiecutter"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Reimplementation of ctags(1)
brew "ctags"
# DuckDuckGo from the terminal
brew "ddgr"
# Command-line tool for getting & setting the default browser
brew "defaultbrowser"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Terminal visual disk space navigator
brew "diskonaut"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Text processing system for reStructuredText
brew "docutils"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# GNU Emacs text editor
brew "emacs"
# Run arbitrary commands when files change
brew "entr"
# OpenType text shaping engine
brew "harfbuzz"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# CLI tool to input and store your ideas without leaving the terminal
brew "eureka"
# Calculator REPL, similar to bc(1)
brew "eva"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# EXIF and IPTC metadata manipulation library and tools
brew "exiv2"
# Work with ID3 metadata in .mp3 files
brew "eye-d3"
# Modern, maintained replacement for ls
brew "eza"
# Development kit for the Java programming language
brew "openjdk"
# Quality control tool for high throughput sequence data
brew "fastqc"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Simple file manager written in bash
brew "fff"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Fully featured Firefox Send client
brew "ffsend"
# Image manipulation
brew "netpbm"
# Web File Browser
brew "filebrowser"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interactive git commands in the terminal
brew "forgit"
# X.Org: XFree86-VidMode X extension
brew "libxxf86vm"
# Graphics Library
brew "mesa"
# Open-source alternative to the OpenGL Utility Toolkit (GLUT) library
brew "freeglut"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Terminal JSON viewer
brew "fx"
# Library for encoding and decoding .avif files
brew "libavif"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Google Drive CLI Client
brew "gdrive"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Command-line utility for uploading Gists
brew "gist"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Cross-platform application and UI framework
brew "qt"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Ping, but with a graph
brew "gping"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Generic library support script
brew "libtool"
# Image processing tools collection
brew "graphicsmagick"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Command-line tool for generating regular expressions
brew "grex"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# GUI toolkit
brew "gtk+"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Integrates GTK macOS applications with the Mac desktop
brew "gtk-mac-integration"
# Tool for glamorous shell scripts
brew "gum"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# CLI email client written in Rust
brew "himalaya"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# Anonymous overlay network - a network within a network
brew "i2p"
# Command-line editor
brew "id3v2"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Convert images to PDF via direct JPEG inclusion
brew "img2pdf"
# Interactive computing in Python
brew "ipython"
# Synchronize a maildir with an IMAP server
brew "isync"
# Audio Connection Kit
brew "jack"
# Just Another Gibbs Sampler for Bayesian MCMC simulation
brew "jags"
# JQ clone focussed on correctness, speed, and simplicity
brew "jaq"
# Ranger-like terminal file manager written in Rust
brew "joshuto"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line note taker
brew "jrnl"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Interactive environments for writing and running code
brew "jupyterlab", link: false
# Handy way to save and run project-specific commands
brew "just"
# Reading, creating, and manipulating file archives
brew "karchive"
# Create documentation from DocBook
brew "kdoctools"
# Easy way to access the system keyring service from python
brew "keyring"
# CLI calendar application
brew "khal"
# KDE Gettext-based UI text internationalization
brew "ki18n"
# Scaffolding tool to get new projects up and running quickly
brew "kickstart"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal file manager
brew "lf"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# C XSLT library for GNOME
brew "libxslt"
# Lynx-like WWW browser that supports tables, menus, etc.
brew "links"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Keep your Mac's application settings in sync
brew "mackup"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Language Server Protocol for Markdown
brew "marksman"
# Easily convert Marp Markdown files into static HTML/CSS, PDF, PPT and images
brew "marp-cli", link: false
# Mac App Store command-line interface
brew "mas"
# Cryptographic & SSL/TLS library
brew "mbedtls@2"
# Fly through your shell history
brew "mcfly"
# Create modern online books from Markdown files
brew "mdbook"
# Show markdown documents on text terminals
brew "mdcat"
# Command-line based markdown presentation tool
brew "mdp"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Fast and user friendly build system
brew "meson"
# Terminal-based visual file manager
brew "midnight-commander"
# Versatile pairwise aligner for genomic and spliced nucleotide sequences
brew "minimap2"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Project documentation with Markdown
brew "mkdocs"
# Deep clean and optimize your Mac
brew "mole"
# Remote terminal application
brew "mosh"
# Lightweight PDF and XPS viewer
brew "mupdf"
# Mongrel of mail user agents (part elm, pine, mush, mh, etc.)
brew "mutt"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Experimental optional static type checker for Python
brew "mypy"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Open source relational database management system
brew "mysql@5.7"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Pager/text based browser
brew "w3m"
# Command-line and local web note-taking, bookmarking, and archiving
brew "nb"
# NCurses Disk Usage
brew "ncdu"
# E-mail reader with support for Notmuch, NNTP and much more
brew "neomutt"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Image processing library
brew "vips"
# Netlify command-line tool
brew "netlify-cli"
# RSS/Atom feed reader for text terminals
brew "newsboat"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Open-source, cross-platform JavaScript runtime environment
brew "node@20"
# Send push notifications to your phone or desktop via PUT/POST
brew "ntfy"
# Package for scientific computing with Python
brew "numpy"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# Python bindings for v6 of Qt
brew "pyqt"
# Port to Qt of the Scintilla editing component
brew "qscintilla2"
# Nonlinear and differential/algebraic equations solver
brew "sundials"
# High-level interpreted language for numerical computing
brew "octave"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Command-line Git information tool
brew "onefetch"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Render and include figures in Pandoc documents using many plotting toolkits
brew "pandoc-plot"
# QR Code generation
brew "qrencode"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# Search PDFs for strings matching a regular expression
brew "pdfgrep"
# Presenter console with multi-monitor support for PDF files
brew "pdfpc"
# Port of pdftk in java
brew "pdftk-java"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Paste PNG into files
brew "pngpaste"
# Fast, disk space efficient package manager
brew "pnpm"
# Python package management tool
brew "poetry"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler-qt5"
# Object-relational database system
brew "postgresql@14"
# Powerful image viewer with minimal UI
brew "pqiv"
# Modern replacement for ps written in Rust
brew "procs"
# Advanced Python REPL
brew "ptpython"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# It's not just a linter that annoys you!
brew "pylint"
# Simple, correct PEP 517 build frontend
brew "python-build"
# Python Language Server for the Language Server Protocol
brew "python-lsp-server"
# Python implementation of Markdown
brew "python-markdown"
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools", link: false
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Qt Cryptographic Architecture (QCA)
brew "qca"
# File browser
brew "ranger"
# Rsync for cloud storage
brew "rclone"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# Command-line deletion tool focused on safety, ergonomics, and performance
brew "rm-improved"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: false
# Extremely fast Python linter, written in Rust
brew "ruff"
# Safe, concurrent, practical language
brew "rust"
# Web search from the terminal
brew "s-search"
# Tools for manipulating next-generation sequencing data
brew "samtools"
# Spreadsheet program for the terminal, using ncurses
brew "sc-im"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Intuitive find & replace CLI
brew "sd"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Fuzzy Finder in rust!
brew "sk"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Terminal based presentation tool
brew "slides"
# Source-code syntax highlighter
brew "source-highlight"
# SOund eXchange: universal sound sample translator
brew "sox"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Data tools for INSDC Sequence Read Archive
brew "sratoolkit"
# Cross-shell prompt for astronauts
brew "starship"
# Strong open-source chess engine
brew "stockfish"
# Version control system designed to be a better CVS
brew "subversion"
# Multi-modal AI tool to extract and summarize content
brew "summarize"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# Generate scripting interfaces to C/C++ code
brew "swig"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Open source continuous file synchronization application
brew "syncthing", link: false
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Feature-rich console based todo list manager
brew "task"
# Terminal user interface for taskwarrior
brew "taskwarrior-tui"
# Tool Command Language
brew "tcl-tk"
# Your todo list in your terminal
brew "td"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# General purpose fuzzy finder TUI
brew "television"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Programmatically correct mistyped console commands
brew "thefuck"
# Helper for multithreaded programming
brew "threadweaver"
# Simplified and community-driven man pages
brew "tldr", link: false
# Terminal multiplexer
brew "tmux"
# CPU, RAM memory, and load monitor for use with tmux
brew "tmux-mem-cpu-load"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Minimal, todo.txt-focused editor
brew "todo-txt"
# Program that allows you to count code, quickly
brew "tokei"
# Upgrade all the things
brew "topgrade"
# Anonymizing overlay network for TCP
brew "tor"
# Command-line translator using Google Translate and more
brew "translate-shell"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli", link: true
# Lightweight, POSIX-compliant regular expression (regex) library
brew "tre"
# Tree command, improved
brew "tre-command"
# Terminal Todo List Manager
brew "ttdl"
# Terminal sharing over the Internet
brew "tty-share"
# Terminal interaction recorder and player
brew "ttyrec"
# Converts a ttyrec file into gif files
brew "ttygif"
# Markup-based typesetting system
brew "typst"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# File synchronization tool
brew "unison"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Syntax-aware linter for prose
brew "vale"
# Command-line interface for Vercel
brew "vercel-cli"
# Your CLI home video recorder
brew "vhs"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Terminal-based Tetris clone
brew "vitetris"
# Web Assembly Binary Toolkit
brew "wabt"
# Create beautiful applications using Go
brew "wails"
# Execute commands when watched files change
brew "watchexec"
# Command-line tool to track (your) time
brew "watson"
# Internet file retriever
brew "wget"
# Utilities to create and convert Web Open Font File (WOFF) files
brew "woff2"
# Personal information dashboard for your terminal
brew "wtfutil"
# Access X11 clipboards from the command-line
brew "xclip"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Command-line program for getting and setting the contents of the X selection
brew "xsel"
# Yet Another Dotfiles Manager
brew "yadm"
# Copy terminal output to clipboard
brew "yank"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Dumb downloader that scrapes the web
brew "you-get"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# GTK+ dialog boxes for the command-line
brew "zenity"
# Plain text note-taking assistant
brew "zk"
# Fast static site generator in a single binary with everything built-in
brew "zola"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# macOS app notarization helper
brew "akeru-inc/tap/xcnotary"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# A terminal-based dashboard for managing cron jobs
brew "antoniorodr/cronboard/cronboard"
# CLI app to manage your Apple Notes and Apple reminders
brew "antoniorodr/memo/memo"
# The modern, text-based browser
brew "browsh-org/browsh/browsh"
# Switch your input method through terminal
brew "daipeihust/tap/im-select"
# A simple command line notebook for programmers
brew "dnote/dnote/dnote"
# Highly configurable TUI project manager
brew "dzfrias/formulae/projectable"
# Analyze and clean your disk space (powered by Rust)
brew "emilevr/space/space"
# A utility to fix mistakes in your commands.
brew "eugene-babichenko/fixit/fixit"
# File system client based on SSH File Transfer Protocol
brew "gromgit/fuse/sshfs-mac"
# Execute any shell command despite having a dollar sign at the beginning of the line.
brew "happyrip/happy-tap/undollar"
# Convert Pandoc Markdown-style footnotes into sidenotes
brew "jez/formulae/pandoc-sidenote"
# Smart terminal session manager
brew "joshmedeski/sesh/sesh"
brew "keith/formulae/reminders-cli"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Rust Cursive TUI that helps manage launchd jobs on macOS
brew "mach-kernel/pkgs/launchk"
# A TUI dashboard for AI coding agents
brew "marcus/tap/sidecar"
# Remote terminal with IP roaming
brew "mistertea/et/et"
# mouseless terminal interaction
brew "morantron/tmux-fingers/tmux-fingers"
# The native component of the Profile Switcher for Firefox extension.
brew "null-dev/firefox-profile-switcher/firefox-profile-switcher-connector"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Fast CLI for Apple Reminders
brew "steipete/tap/remindctl"
# Supabase CLI
brew "supabase/tap/supabase"
# A Markdown browser for your terminal
brew "textualize/homebrew/frogmouth"
brew "tursodatabase/tap/turso"
brew "yakitrak/yakitrak/obsidian-cli"
# Interface library
brew "zegervdv/zathura/girara", args: ["HEAD"]
# Git prepare-commit-msg hook for authoring commit messages with GPT-3
brew "zurawiki/brews/gptcommit"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Control every piece of your controller
cask "8bitdo-ultimate-software"
# Time tracker
cask "activitywatch"
# Create and modify subtitles
cask "aegisub"
# GPU-accelerated terminal emulator
cask "alacritty"
# Chromium-based web browser
cask "alex313031-thorium"
# Enable Windows-like alt-tab
cask "alt-tab"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Memory training application
cask "anki"
# Local-first and end-to-end encrypted notes app
cask "anytype"
# Inspect application bundles
cask "apparency"
# Application uninstaller
cask "appcleaner"
# Open-source project and knowledge management tool
cask "appflowy"
# Chromium based browser
cask "arc"
# Electronics prototyping platform
cask "arduino"
# Multi-track audio editor and recorder
cask "audacity"
# Mute or unmute the system based on the current Wi-Fi network
cask "automute"
# Audio utility
cask "background-music"
# Edit and manage bibliographies
cask "bibdesk"
# Official bilibili video streaming and sharing platform
cask "bilibili"
# Desktop password and login vault
cask "bitwarden"
# Virtual Audio Driver
cask "blackhole-2ch"
# 3D creation suite
cask "blender"
# Translation application for text, pictures, and manual input
cask "bob-app"
# Scriptable scratchpad for developers
cask "boop"
# Web browser focusing on privacy
cask "brave-browser"
# Transcribe and translate audio
cask "buzz"
# E-books management software
cask "calibre"
# Finder Toolbar app to open the current directory in the Terminal
cask "cd-to"
# Desktop app for GPT-4 / GPT-3.5 (OpenAI API)
cask "chatbox"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Free and open-source web browser
cask "chromium"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Text expansion, screenshot & annotation, and clipboard management tool
cask "codeexpander"
# Audio player
cask "cog-app"
# Clipboard manager
cask "copyclip"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Write, edit, and chat about your code with AI
cask "cursor"
# Photography workflow application and raw developer
cask "darktable"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Universal database tool and SQL client
cask "dbeaver-community"
# File encryption tool
cask "deadbolt"
# Agentic IDE with AI agent command center
cask "devin-desktop"
# Utilities designed to make common development tasks easier
cask "devtoys"
# All-in-one toolbox for developers
cask "devutils"
cask "dictater"
# Digital photo manager
cask "digikam"
# Voice and text chat software
cask "discord"
# Online diagram software
cask "drawio"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser focusing on privacy
cask "duckduckgo"
# Use your gamepad or joystick like a mouse and keyboard
cask "enjoyable"
# Cross-platform Text Expander written in Rust
cask "espanso"
# Status monitoring
cask "eul"
# Book reader
cask "fbreader"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Screenshot software with built-in annotation tools
cask "flameshot"
# Screen colour temperature controller
cask "flux-app"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-gensekigothic"
cask "font-gensenrounded"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-kosugi-maru"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-lilex-nerd-font"
cask "font-m+-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monocraft-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-emoji"
cask "font-noto-nerd-font"
cask "font-noto-sans-cjk"
cask "font-noto-serif-cjk"
cask "font-noto-serif-cjk-tc"
cask "font-opendyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-roboto-serif"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"
# PDF reader
cask "foxitreader"
# Mind mapping and knowledge management software
cask "freeplane"
# Notes manager
cask "fsnotes"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Solve, save and share math problems, graph functions, etc
cask "geogebra"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
cask "gifcapture"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome@beta"
# Client for the Google Drive storage service
cask "google-drive"
# Podcast client
cask "gpodder"
# Desktop automation application
cask "hammerspoon"
# Utility to hide menu bar items
cask "hiddenbar"
# Free and open-source media player
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Vector graphics editor
cask "inkscape"
# Tool for multi-language users
cask "input-source-pro"
# Menu bar calendar
cask "itsycal"
# Reference manager to edit, manage and search BibTeX files
cask "jabref"
# Statistical software
cask "jamovi"
# Desktop application for JupyterLab
cask "jupyterlab-app"
# Keyboard customiser
cask "karabiner-elements"
# Open-source keystroke visualiser
cask "keycastr"
# Find shortcuts for any installed application
cask "keyclu"
# AI-powered productivity tool for the command-line
cask "kiro-cli"
# GPU-based terminal emulator
cask "kitty"
# Open-source epub reader
cask "koodo-reader"
# Free and open-source painting and sketching program
cask "krita"
# Utility that shows the latest app updates
cask "latest"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Discover, download, and run local LLMs
cask "lm-studio"
# Software for Logitech devices
cask "logitech-options"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Lyrics for iTunes, Spotify, Vox and Audirvana Plus
cask "lyricsx"
# Clipboard manager
cask "maccy"
# File system integration
cask "macfuse"
# Extensible two-pane file manager
cask "marta"
# Code snippets manager for developers
cask "masscode"
# Mathematics editor
cask "mathcha-notebook"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Menu bar browser
cask "menubarx"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Minimal installer for conda
cask "miniconda"
# App for launching iOS and Android simulators
cask "minisim"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Music player
cask "museeks"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# Htop on steroids
cask "neohtop"
# Free and open-source RSS reader
cask "netnewswire"
# App to write, plan, collaborate, and get organised
cask "notion"
# Streaming music player
cask "nuclear"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Document editor
cask "onlyoffice"
# Finder Toolbar app to open the current directory in Terminal or Editor
cask "openinterminal"
# Free and open-source productivity suite
cask "openoffice"
# Cross-platform video editor
cask "openshot-video-editor"
# Replacement for Docker Desktop
cask "orbstack"
# WebKit based web browser
cask "orion"
# GUI prototyping tool
cask "pencil"
cask "pennywise"
# Code snippets, screenshots and workflow context
cask "pieces"
# Local datastore, server, and ML engine powering the Pieces for Developers Suite
cask "pieces-os"
# Colour picker for colours onscreen
cask "pika"
# Timer application
cask "pomotroid"
# Data science IDE
cask "positron"
# Retrieves and analyzes academic citations
cask "publish-or-perish"
# IDE for Python programming - Community Edition
cask "pycharm-ce"
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Plain-text file notepad and todo-list manager
cask "qownnotes"
# Scientific and technical publishing system built on Pandoc
cask "quarto"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Thumbnails, static previews, cover art and metadata for video files
cask "quicklook-video"
# Quick Look generator for Adobe Swatch Exchange files
cask "quicklookase"
# A lightweight and high-performance screen recorder for macOS.
cask "lihaoyun6/tap/quickrecorder"
# Keyboard-driven, vim-like browser based on PyQt5
cask "qutebrowser"
# Image viewer
cask "qview"
# Environment for statistical computing and graphics
cask "r-app"
# All-in-one bookmark manager
cask "raindropio"
# Control your tools with a few keystrokes
cask "raycast"
# Email client
cask "readdle-spark"
# Ebook reader
cask "readest"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Data science software focusing on R and Python
cask "rstudio"
# PDF reader and note-taking application
cask "skim"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# SQL client
cask "sqlectron"
# Free, open-source, and completely encrypted notes app
cask "standard-notes"
# Tencent cloud gaming platform
cask "start"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Open-source media center
cask "stremio"
# To-do list and time tracker
cask "super-productivity"
# Application for inspecting installer packages
cask "suspicious-package"
# Interior design application
cask "sweet-home3d"
# Menu bar customization tool
cask "swiftbar"
# Real time file synchronisation software
cask "syncthing-app"
# Quicklook extension for source files
cask "syntax-highlight"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Unpacks archive files
cask "the-unarchiver"
# To-do list
cask "todoist-app"
# Minimalist, keyboard-driven to-do manager
cask "todotxt"
# Menu bar pomodoro timer
cask "tomatobar"
# Hierarchical spreadsheet and outline application
cask "treesheets"
# Easy to use text extraction tool
cask "trex"
# Scratch paper that lives on your menu bar
cask "tyke"
# Tool to invert scroll direction for physical scroll wheels
cask "unnaturalscrollwheels"
# uPic is a native, powerful, beautiful and simple picture and file upload tool for macOS
cask "bigwig-club/brew/upic"
# Virtual machines UI using QEMU
cask "utm"
# Configurator of compatible keyboards in real time
cask "vial"
# Free all-in-one video editor
cask "videofusion"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Video communication and virtual meeting platform
cask "webex"
# Free messaging and calling application
cask "wechat"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Native desktop client for WhatsApp
cask "whatsapp"
# View output from scripts in the menu bar
cask "xbar"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Multiplayer code editor
cask "zed"
# Open-source markdown editor
cask "zettlr"
# Video communication and virtual meeting platform
cask "zoom"
mas "Amphetamine", id: 937984704
mas "CamFrame", id: 6478444750
mas "Focalboard", id: 1556908618
mas "GamepadMapper", id: 1517291304
mas "Gapplin", id: 768053424
mas "IPEVO Annotator", id: 1237562727
mas "JoyKeyMapper", id: 1511416593
mas "Klib", id: 1196268448
mas "Magnet Crop", id: 1547800025
mas "MarkEdit", id: 1669953820
mas "Notenik", id: 1465997984
mas "PDF Search", id: 1229271394
mas "Pocket", id: 568494494
mas "ProgrammableTooltip", id: 1495732622
mas "Prompt", id: 1483052809
mas "RunCat", id: 1429033973
mas "Table Tool", id: 1122008420
mas "Tempus Stopwatch", id: 1491326665
mas "Tot", id: 1491071483
mas "Vimari", id: 1480933944
mas "訂閱通", id: 1577082754
go "github.com/htlin/claude-tools/cmd/claude-hooks"
go "github.com/htlin/claude-tools/cmd/claude-statusline"
go "github.com/theredditbandit/pman"
go "github.com/wailsapp/wails/v2/cmd/wails"
cargo "add-gitignore"
cargo "add-gitignore-cli"
cargo "bk"
cargo "git-graph"
cargo "mdbook"
cargo "mdbook-theme"
cargo "ttdl"
uv "aline-ai"
uv "asciinema"
uv "baca"
uv "ccbot"
uv "cookiecutter"
uv "ductor"
uv "edge-tts"
uv "emailproxy"
uv "epr-reader"
uv "epy-reader"
uv "holehe"
uv "jrnl"
uv "llm"
uv "maigret"
uv "marimo"
uv "markdown-toc"
uv "md2anki"
uv "pter"
uv "radian"
uv "ruff"
uv "sherlock-project"
uv "sphinx"
uv "terminaltexteffects"
npm "@argdown/cli"
npm "@biomejs/biome"
npm "@getpaseo/cli"
npm "@gitlawb/openclaude"
npm "@google/clasp"
npm "@mariozechner/pi-coding-agent"
npm "@marp-team/marp-cli"
npm "@musistudio/claude-code-router"
npm "@openai/codex"
npm "@siteboon/claude-code-ui"
npm "aicommits"
npm "apple-notifier-mcp"
npm "clawdbot"
npm "ctb"
npm "ffmpeg-progressbar-cli"
npm "happy-coder"
npm "http-server"
npm "llm-checker"
npm "mcp-zotero"
npm "onecontext-ai"
npm "playwright"
npm "prettier"
npm "quicktype"
npm "shx"
npm "svg-term-cli"
npm "task-master-ai"
npm "yanki-mcp-server"
