tap "daipeihust/tap"
tap "federico-terzi/espanso"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "zegervdv/zathura"
# Library for manipulating PNG images
brew "libpng"
# Core application library for C
brew "glib"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9", link: false
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# High performance code minimap generator
brew "code-minimap"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Simple, fast and user-friendly alternative to find
brew "fd"
# Generic library support script
brew "libtool"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# X.Org: XFree86-VidMode X extension
brew "libxxf86vm"
# Graphics Library
brew "mesa"
# Open-source alternative to the OpenGL Utility Toolkit (GLUT) library
brew "freeglut"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Command-line utility for uploading Gists
brew "gist"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Anonymous overlay network - a network within a network
brew "i2p"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Platform built on V8 to build network applications
brew "node", link: false
# Swiss-army knife of markup format conversion
brew "pandoc", link: false
# Interactive environments for writing and running code
brew "jupyterlab", link: false
# Simple terminal UI for git commands
brew "lazygit"
# X.509 and CMS library
brew "libksba"
# MNG/JNG reference library
brew "libmng"
# Library that sends desktop notifications to a notification daemon
brew "libnotify"
# YAML Parser
brew "libyaml"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Lynx-like WWW browser that supports tables, menus, etc.
brew "links"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Command-line based markdown presentation tool
brew "mdp"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Fast and user friendly build system
brew "meson"
# Terminal-based visual file manager
brew "midnight-commander"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# It's not just a linter that annoys you!
brew "pylint"
# Cross-platform application and UI framework
brew "qt"
# File browser
brew "ranger"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Strong open-source chess engine
brew "stockfish"
# Version control system designed to be a better CVS
brew "subversion"
# Open source continuous file synchronization application
brew "syncthing", link: false
# Feature-rich console based todo list manager
brew "task"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# CPU, RAM memory, and load monitor for use with tmux
brew "tmux-mem-cpu-load", link: false
# Manage complex tmux sessions easily
brew "tmuxinator"
# Anonymizing overlay network for TCP
brew "tor"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Terminal-based Tetris clone
brew "vitetris"
# Internet file retriever
brew "wget"
# Command-line program for getting and setting the contents of the X selection
brew "xsel"
# Yet Another Dotfiles Manager
brew "yadm"
# Dumb downloader that scrapes the web
brew "you-get"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Switch your input method through terminal
brew "daipeihust/tap/im-select"
# Interface library
brew "zegervdv/zathura/girara"
# PDF viewer
brew "zegervdv/zathura/zathura", args: ["HEAD"]
# Poppler backend plugin for zathura
brew "zegervdv/zathura/zathura-pdf-poppler"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Create and modify subtitles
cask "aegisub"
# Inspect application bundles
cask "apparency"
# Electronics prototyping platform
cask "arduino"
# Multi-track audio editor and recorder
cask "audacity"
# Mute or unmute the system based on the current Wi-Fi network
cask "automute"
# Official bilibili video streaming and sharing platform
cask "bilibili"
# Translation application for text, pictures, and manual input
cask "bob"
# E-books management software
cask "calibre"
# Finder Toolbar app to open the current directory in the Terminal
cask "cd-to"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Photography workflow application and raw developer
cask "darktable"
# Universal database tool and SQL client
cask "dbeaver-community"
cask "dictater"
# Digital photo manager
cask "digikam"
# Draw.io is free online diagram software
cask "drawio"
# Web browser focusing on privacy
cask "duckduckgo"
# Collaborative team software
cask "figma"
# Screen color temperature controller
cask "flux"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-bigblue-terminal-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-mono-nerd-font"
cask "font-gensekigothic"
cask "font-gensenrounded"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
# Available as kosugi
cask "font-kosugi-maru"
cask "font-monofur-nerd-font"
cask "font-noto-emoji"
cask "font-noto-sans-cjk"
cask "font-noto-serif-cjk"
cask "font-overpass-nerd-font"
# Just as comfortable to read and work in print media
cask "font-roboto-serif"
cask "font-ubuntu-mono-nerd-font"
# Free and open-source image editor
cask "gimp"
# Word processor that shows structure and content
cask "gingko"
# Desktop client for GitHub repositories
cask "github"
# Client for the Google Drive storage service
cask "google-drive"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Utility to hide menu bar items
cask "hiddenbar"
# Shortcut manager
cask "icanhazshortcut"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# Utility to render Jupyter notebooks
cask "jupyter-notebook-viewer"
# Open-source screen recorder built with web technology
cask "kap"
# Keyboard customizer
cask "karabiner-elements"
# Free and Open Source Video Editor
cask "kdenlive"
# Free and open-source painting and sketching program
cask "krita"
# Snippet management app
cask "lepton"
# Office suite
cask "libreoffice"
# Software for Logitech devices
cask "logi-options-plus"
# Software for Logitech devices
cask "logitech-options"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Web browser
cask "microsoft-edge"
# Minimal browser that protects privacy
cask "min"
# Open-source download manager
cask "motrix"
# Free and open-source RSS reader
cask "netnewswire"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# Cloud storage client
cask "onedrive"
# Document editor
cask "onlyoffice"
# Finder Toolbar app to open the current directory in Terminal or Editor
cask "openinterminal"
# Tool for uploading images
cask "picgo"
# Native markdown editor
cask "pine"
# Command-line shell and scripting language
cask "powershell"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook plugin for plaintext files without an extension
cask "qlstephen"
# QuickLook generator for video files
cask "qlvideo"
# QuickLook plugin for JSON files
cask "quicklook-json"
# QuickLook generator for Adobe Swatch Exchange files
cask "quicklookase"
# Environment for statistical computing and graphics
cask "r"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Free and open-source page layout program
cask "scribus"
# Tool for sending personal documents to Kindles from Macs
cask "send-to-kindle"
# Video editor
cask "shotcut"
# Screenshot measurement and annotation tool
cask "shottr"
# PDF reader and note-taking application
cask "skim"
# Graphical client for Git version control
cask "sourcetree"
# All-in-one live streaming software
cask "streamlabs-obs"
# To-do list and time tracker
cask "superproductivity"
# Application for inspecting installer packages
cask "suspicious-package"
# Real time file synchronization software
cask "syncthing"
# CSV file editor
cask "table-tool"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Epub reader
cask "thorium"
# Open-source BitTorrent client
cask "transmission"
# Easy to use text extraction tool
cask "trex"
# Virtual machines UI using QEMU
cask "utm"
# Plug-in productivity tool set
cask "utools"
# Development environment
cask "vagrant"
# Configurator of compatible keyboards in real time
cask "vial"
# GUI for the Neovim text editor
cask "vimr"
# Virtualizer for x86 hardware
cask "virtualbox"
# Free messaging and calling application
cask "wechat"
# HTML to PDF renderer
cask "wkhtmltopdf"
# Create diagrams manually, or import external data for analysis
cask "yed"
# Open-source markdown editor
cask "zettlr"
mas "Drafts", id: 1435957248
mas "Exporter", id: 1099120373
mas "Highlights", id: 1498912833
mas "Infuse", id: 1136220934
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "LINE", id: 539883307
mas "MarginNote 3", id: 1423522373
mas "Messenger", id: 1480068668
mas "NotePlan 3", id: 1505432629
mas "Notion Web Clipper", id: 1559269364
mas "Pages", id: 409201541
mas "Session", id: 1521432881
mas "Simplenote", id: 692867256
mas "Stockfish", id: 801463932
mas "TextSniper", id: 1528890965
mas "Xcode", id: 497799835
mas "熊掌記", id: 1091189122
